export const gameStateText = {
  0: '已结束',
  5: '准备中',
  10: '即将开始',
  20: '开放激活',
  30: '人数已满',
  40: '连斗中',
  50: '死斗中'
}

export const chatTypeText = {
  0: '公频',
  1: '队伍',
  2: '系统',
  3: '私聊'
}

export const itemTypeText = {
  DN: '内衣',
  DB: '身体装备',
  DH: '头部装备',
  DA: '手臂装备',
  DF: '腿部装备',
  A: '饰物',
  Ag: '同志饰物',
  Al: '热恋饰物',
  N: '无',
  X: '合成专用',
  Y: '特殊',
  Z: '特殊(不可合并)',
  GB: '手枪弹药',
  GBr: '机枪弹药',
  GBi: '气体弹药',
  GBh: '重型弹药',
  GBe: '能源弹药',
  WP: '钝器',
  WK: '锐器',
  WG: '远程兵器',
  WJ: '重型枪械',
  WF: '灵力兵器',
  WD: '爆炸物',
  WB: '弓',
  WC: '投掷兵器',
  WN: '空手'
}
