export const gameStateText = {
  0: '已结束',
  5: '准备中',
  10: '即将开始',
  20: '开放激活',
  30: '人数已满',
  40: '连斗中',
  50: '死斗中',
};

export const chatTypeText = {
  0: '公频',
  1: '队伍',
  2: '系统',
  3: '私聊',
};

export const itemTypeText = {
  DN: '内衣',
  DB: '身体装备',
  DH: '头部装备',
  DA: '手臂装备',
  DF: '腿部装备',
  A: '饰物',
  Ag: '同志饰物',
  Al: '热恋饰物',
  N: '无',
  X: '合成专用',
  Y: '特殊',
  Z: '特殊(不可合并)',
  GB: '手枪弹药',
  GBr: '机枪弹药',
  GBi: '气体弹药',
  GBh: '重型弹药',
  GBe: '能源弹药',
  WP: '钝器',
  WK: '锐器',
  WG: '远程兵器',
  WJ: '重型枪械',
  WF: '灵力兵器',
  WD: '爆炸物',
  WB: '弓',
  WC: '投掷兵器',
  WN: '空手',
};

export const trapTypeText = {
  TO: '已布设陷阱',
  TN: '可拾取陷阱',
  TNc: '奇迹雷',
};

// NPC 类型映射，源自 DTS-SAMPLE 配置
export const npcTypeText = {
  1: '红杀将军',
  2: '全息幻象',
  4: '拟似意识',
  5: '杏仁豆腐',
  6: '黑幕',
  7: '幻影执行官',
  8: '管理员',
  9: '红杀菁英',
  11: '真职人',
  12: '未名存在',
  13: '循环使者',
  14: '数据碎片',
  15: '模因总裁',
  16: '幻境技术总监',
  20: '英雄',
  21: '武神',
  22: '天神',
  40: '模因卫队',
  45: '电波幽灵',
  88: '■■',
  90: '各路党派',
};
